<a href="https://colab.research.google.com/github/NeilCollinsMS/Esports-Earnings-Analysis/blob/main/Esports_Earnings_Analysis.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

**Esports Earnings Analysis**

In [1]:
import pandas as pd
import numpy as np
import os
import io
from google.colab import drive
from google.colab import files

In [10]:
drive.mount('/content/drive')
os.chdir("drive/My Drive")

Drive already mounted at /content/drive; to attempt to forcibly remount, call drive.mount("/content/drive", force_remount=True).

In [11]:
os.getcwd()

'/content/drive/My Drive'

In [15]:
high_earning_players = pd.read_csv('highest_earning_players.csv', error_bad_lines=False, index_col=False, dtype='unicode')
high_earning_teams = pd.read_csv('highest_earning_teams.csv', error_bad_lines=False, index_col=False, dtype='unicode')
locations = pd.read_csv('country-and-continent-codes-list.csv', error_bad_lines=False, index_col=False, dtype='unicode')

In [19]:
display(high_earning_players.head())
display(high_earning_teams.head())
display(locations.head())

  PlayerId NameFirst  ...                              Game                 Genre
0     3883     Peter  ...  Counter-Strike: Global Offensive  First-Person Shooter
1     3679   Andreas  ...  Counter-Strike: Global Offensive  First-Person Shooter
2     3885   Nicolai  ...  Counter-Strike: Global Offensive  First-Person Shooter
3     3672     Lukas  ...  Counter-Strike: Global Offensive  First-Person Shooter
4    17800      Emil  ...  Counter-Strike: Global Offensive  First-Person Shooter

[5 rows x 8 columns]

  TeamId             TeamName  ...       Game                 Genre
0    760  San Francisco Shock  ...  Overwatch  First-Person Shooter
1    776      London Spitfire  ...  Overwatch  First-Person Shooter
2    768   New York Excelsior  ...  Overwatch  First-Person Shooter
3    773  Philadelphia Fusion  ...  Overwatch  First-Person Shooter
4    766        Seoul Dynasty  ...  Overwatch  First-Person Shooter

[5 rows x 6 columns]

  Continent_Name Continent_Code  ... Three_Letter_Country_Code Country_Number
0           Asia             AS  ...                       AFG              4
1         Europe             EU  ...                       ALB              8
2     Antarctica             AN  ...                       ATA             10
3         Africa             AF  ...                       DZA             12
4        Oceania             OC  ...                       ASM             16

[5 rows x 6 columns]